In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from sqlalchemy import text

In [9]:
secrets_file = open("../.secrets", 'r')
conn_secret = secrets_file.readline().strip()
conn_secret

'mysql+pymysql://notepal:ThetaTauUTDNotePal2023@72.182.161.176/notepal'

In [10]:
engine = create_engine(conn_secret)

In [18]:
class_names = pd.read_sql("SELECT DISTINCT class_number, course_prefix FROM class;", engine)
class_names

      class_number course_prefix
0             2301          ACCT
1             2302          ACCT
2             3101          ACCT
3             3312          ACCT
4             3322          ACCT
...            ...           ...
1248          6330          VPAS
1249          6339          VPAS
1250          6373          VPAS
1251          6393          VPAS
1252          7360          VPAS

[1253 rows x 2 columns]

In [20]:
instructor_names = pd.read_sql("SELECT DISTINCT instructor FROM class;", engine)
instructor_names

                                  instructor
0                Zhang, Jieying; Zhang, Yang
1               Ozel, Naim Bugra; Gu, Dongdi
2                  Zhou, Yibin; Yayvak, Berk
3                Dai, Zhonglan; Zhou, Junfei
4         Pereira Pinto, Jedson; Kim, Jongha
...                                      ...
1628  Trevino, Christopher L; Saba, Monica M
1629                          Thomas, John D
1630                             Phan, Trong
1631                Parsoneault, Catherine J
1632                        Warren, Shilyh J

[1633 rows x 1 columns]

In [21]:
with engine.connect() as conn:
    class_names.to_sql(name="class", index=False, con=conn, if_exists="append")